/* error message: kErrConv7To8_ConversionError */
"Could not convert song format." = "Δεν είναι δυνατή η μετατροπή της μορφής τραγουδιού.";

/* error message: kErrConv7To8_DamagedSong */
"This project seems to be damaged. Please restore from backup." = "Αυτό το έργο φαίνεται να έχει καταστραφεί. Κάντε επαναφορά από εφεδρικό αντίγραφο.";

/* error message: kErrConv7To8_NonReleaseLogicVersion */
"This project has been created with an intermediate non-release Logic version. It can't be opened any longer" = "Αυτό το έργο έχει δημιουργηθεί με ενδιάμεση έκδοση του Logic που δεν κυκλοφορεί. Δεν μπορείτε πλέον να το ανοίξετε";

/* error message: kErrConv7To8_PreLogic5Version - Message for High Sierra only */
"The song you are trying to open is in Logic 4 format (or earlier). Please open and save it with Logic 7.2.1 or earlier first.\n\nYou have to do that on a Macintosh computer, which still runs an older version of macOS, because these old versions of Logic Pro are no longer compatible with macOS 10.13 or later." = "Το τραγούδι που προσπαθείτε να ανοίξετε είναι σε μορφή Logic 4 (ή προγενέστερη έκδοση). Ανοίξτε το και αποθηκεύστε το πρώτα με το Logic 7.2.1 ή προγενέστερη έκδοση.\n\nΠρέπει να κάνετε αυτήν την ενέργεια σε υπολογιστή Macintosh με παλαιότερη έκδοση του macOS, διότι αυτές οι παλαιότερες εκδόσεις του Logic Pro δεν είναι πλέον συμβατές με το macOS 10.13 ή μεταγενέστερη έκδοση.";
